clear

% Масив із чотирьох двоелементних векторів, які треба розділити на 2 класи
p = [.1 .8 .1 .9; .2 .9 .1 .8];

% Прошарок Кохонена з двома нейронами для аналізу двоелементних векторів входу з діапазоном значень від 0 до 1.
% Перший аргумент вказує діапазон вхідних значень, другий визначає кількість нейронів у прошарку.
net = newc([0 1; 0 1],2);

wts = net.IW{1,1}

% Храктеристика прошароку Кохонена
net.layers{1}

% Храктеристика зсувів
net.biases{1}

% Зміщення
net.b{1}

gensim(net)
