clear

% Створимо навчальний набір випадкових двовимірних векторів, 
% елементи яких розподілені за рівномірним законом в інтервалі [-1 1]:
P = rands (2,1000);
plot(P(1,:),P(2,:),'+') % Рис.14

% Для кластеризації векторів входу створимо самоорганізаційну картку Кохонена
% розміру 5х6 з 30 нейронами, розміщеними на гексагональній сітці
net = newsom([-1 1; -1 1], [5,6]);
net.trainParam.epochs = 1000;
net.trainParam.show = 100;
net = train (net, P);
plotsom(net.IW{1,1},net.layers{1}.distances)

a = sim(net, [0.5; 0.3])
hold on, plot(0.5,0.3,'*k') % Рис.15,в

a = sim (net, P);
bar(sum(a')) % Рис.16