% SPREAD досить великий (12), всі ф-ції активації перекриваються 
% і кожен базисний нейрон видає зн-ння, близьке до 1 для всіх значень входів. 
% Це приводить до того, що мережа не реагує на вхідні значення. 
% Функція newrb намагатиметься будувати мережу, але не 
% зможе забезпечити необхідної точності через обчислювальні проблеми.

GOAL = 0.01;% Допустиме значення функціоналу помилки
SPREAD = 12; % Параметр впливу
net = newrb(P,T,GOAL,SPREAD); % Створення мережі
net.layers{1}.size % Число нейронів у прихованому прошарк

plot(P,T,'+k') % Точки навчальної множини
hold on;
X = -1: 0.01: 1;
Y = sim (net, X); % Моделювання мережі
plot(X,Y); 