% Вплив параметра SPREAD на структуру р.б.м. та якість апроксимації. 
% У прикладі SPREAD=0.01. Це означає, що діапазон перекриття вхідних значень
% становить лише +-0.01, а оскільки навчальні входи задані з інтервалом 0.1, 
% вхідні значення функціями активації не перекриваються.

GOAL = 0.01;% Допустиме значення функціоналу помилки
SPREAD = 0.01;% Параметр впливу
net = newrb(P,T,GOAL,SPREAD); % Створення мережі
net.layers{1}.size % Число нейронів у прихованому прошарку

plot(P,T,'+k') % Точки навчальної множини
hold on;
X = -1: .01: 1;
Y = sim (net, X); % Моделювання мережі
plot(X,Y); % Рис. 8
