% Сформуємо навчальну множину і задамо допустиме значення 
% функціоналу помилки, що дорівнює 0.01,
% параметр впливу визначимо рівним 1 
% і використовув. ітераційну процедуру формування р.б.м.

P = -1: 0.1:1; % Масив вхідних векторів
T = [-.9602 -.5770 -.0729 .3771 .6405 .6600 .4609 .1336 ...
-.2013 -.4344 -.5000 -.3930 -.1647 .0988 .3072 .3960 ...
.3449 .1816 -.0312 -.2189 -.3201]; % Масив векторів цілей

GOAL = 0.01;% Допустиме значення функціоналу помилки
SPREAD = 1; % Параметр впливу
net = newrb(P,T,GOAL,SPREAD); % Створення мережі
net.layers{1}.size % Число нейронів у прихованому прошарку

plot(P,T,'+k') % Точки навчальної множини
hold on;
X = -1: .01: 1;
Y = sim (net, X); % Моделювання мережі
plot(X,Y); 