% Вибірка з набору двох синусоїд з амплітудами 1.0 та 2.0
p1 = sin(1:20);
p2 = sin(1:20)*2;

% Цільовими виходами такої мережі є вектори
t1 = ones (1,20);
t2 = ones (1,20) * 2;

% Сформуємо набір векторів входу та цільових виходів
p = [p1 p2 p1 p2];
t = [t1 t2 t1 t2];

% Сформуємо навчальну послідовність у вигляді масивів комірок
Pseq = con2seq (p);
Tseq = con2seq(t);

% Графіки синусоїд
figure;
subplot(2, 1, 1);
plot(p1);
hold on;
plot(p2);
title('Синусоїди з амплітудами 1.0 та 2.0');
legend('Амплітуда 1.0', 'Амплітуда 2.0');
xlabel('Час');
ylabel('Значення');

subplot(2, 1, 2);
plot(p);
title('Комбінована синусоїда');
xlabel('Час');
ylabel('Значення');


% Завдання вище вимагає, щоб мережа Елмана на кожному кроці спостереження 
% значень вибірки могла виявити єдиний її параметр - амплітуду синусоїди. 
% Це означає, що мережа повинна мати 1 вхід та 1 вихід
R = 1; % Число елементів входу
S2 = 1; % Число нейронів вихідного прошарку

% Рекурентний прошарок може мати будь-яке число нейронів, 
% і чим складніше завдання, тим більше нейронів потрібно. 
% Зупинимося на 10 нейронах рекурентного прошарку
S1 = 10; % Число нейронів рекурентного прошарку

% Елементи входу для цієї задачі змінюються в діапазоні від –2 до 2. 
% Для навчання використовується метод градієнтного спуску зі збуренням та 
% адаптацією параметра швидкості налаштування, реалізований у вигляді М-функції traingdx
net = newelm([-2 2],[S1 S2],{'tansig','purelin'},'traingdx');

net.layers{1}
net.layers{2}

net.trainParam.epochs = 1000; % Кількість циклів навчання
net.trainParam.show =25; % Періодичність виведення результатів
net.trainParam.goal =0.01; % Кінцева похибка навчання
[net, tr] = train (net, Pseq, Tseq);

% Після 500 циклів навчання отримаємо графік помилки


% Перевірка мережі
figure(2)
a = sim (net, Pseq);
time = 1: length (p);
plot(time, t,'--', time, cat(2,a{:}))
axis([1 80 0.8 2.2]) % Рис.3

% Перевірка на узагальнення
% Подамо на мережу набір сигналів, складений з двох синусоїд з амплітудами 1.6 та 1.2 
p3 = sin(1:20)*1.6;
t3 = ones (1,20) * 1.6;
p4 = sin(1:20)*1.2;
t4 = ones (1,20) * 1.2;
pg = [p3 p4 p3 p4];
tg = [t3 t4 t3 t4];
pgseq = con2seq (pg);

figure(3)
a = sim (net, pgseq);
time = 1: length (pg);
plot(time, tg,'--', time, cat(2,a{:}))
axis([1 80 0.8 2.2])



