% Припустимо, що потрібно створити модифіковану мережу Хопфілда 
% з двома точками рівноваги, заданими у тривимірному просторі
T = [-1 -1 1; 1 -1 1]'
% Синтез мережі, використовуючи М-функцію newhop
net = newhop(T);

% Виконаємо моделювання мережі Хопфілда, врахувавши, 
% що ця мережа не має входів і містить рекурентний прошарок; 
% у цьому випадку цільові вектори визначають початковий стан прошарку Ai, 
% а другий аргумент функції sim - це число цільових векторів
Ai = T;
[Y, Pf, Af] = sim (net, 2, [], Ai);
Y

% Задамо іншу початкову умову у вигляді масиву комірок
Ai = {[-0.5; 0.6; -0.7]};
Ai{1,1}

% перше ‒ це такт дискретності (визначає інтервал між двома послідовними моментами знімання даних), 
% друге ‒ кількість кроків моделювання (кількість ітерацій), 
% а в якості четвертого аргументу початкові умови лінії затримки.
[Y, Pf, Af] = sim (net, {1 5}, {}, Ai);
Y=cat(2, Y{:})

