% Вхідний сигнал приймає з-ня в діап. від 0 до 10 і сформуємо ЛМ з одним входом і одним виходом
net = newlin([0,10],1);

% Введемо ЛЗ із двома тактами затримки
net.inputWeights{1,1}.delays = [0 1 2];

% Визначимо такі початкові значення ваг та зміщення
net.IW{1,1} = [7 8 9];
net.b{1} = [0];

% Задаємо початкові умови для динамічних блоків ЛЗ
pi = {1 2}
% Цим завершується формування мережі

% Визначимо вхідний сигнал у вигляді наступної послідовності значень
p = {3 4 5 6}

% Промоделюємо мережу
[a, pf] = sim (net, p, pi);

% Припустимо, що задана наступна бажана послідовність для виходу фільтра
T = {10 20 30 40};

% Виконаємо н-ня параметрів, використовуючи процедуру адаптації adapt та 10 циклів навчанн
net.adaptParam.passes = 10;
[net, y, E pf, af] = adapt (net, p, T, pi); % Процедура адаптації

% Виведемо отримані значення ваг, зміщення та вихідного сигналу
wts = net.IW {1,1}, bias = net.b {1}, y

% Якщо продовжити процедуру н-ня, можна ще точніше наблизити вихідний сигнал до бажаного
net.adaptParam.passes = 500;
[net, y, E, pf, af] = adapt (net, p, T, pi);
y

