% Створюємо персептрон із двоелементним вектором входу та одним нейроном
net = newp([-2 2; -2 2],1);

net.inputweights{1, 1} % характеристики ваг входу

wts = net.IW {1,1} 
bias = net.b {1}

% Перевстановимо значення елементів матриці ваги та зміщення
net.IW{1,1} = [3, 4]
net.b{1} = 5

% Щоб повернутися до початкових парам. персептрона, скористаємось ф-єю init
net = init (net);
wts

bias

% Задати функції ініціалізації ваг та зміщень
net.inputweights{1,1}.initFcn = 'rands';
net.biases{1}.initFcn = 'rands';
% Виконати ініціалізацію раніше створеної мережі з новими функціями
net = init (net);
wts = net.IW {1,1}

bias = net.b {1}